; domain
(define
	(domain cwiczenie)
	(:requirements :adl)
	(:types pole obiekt)
	(:predicates
		(robot-gdzie ?p - pole)
		(obiekt-gdzie ?o - obiekt ?p - pole)
		(sasiad ?p ?pp - pole)
		(chwytak-pusty)
		(obiekt-trzymany ?o - obiekt)
	)
	
	(:action jedz-z-do
		:parameters (?p ?pp - pole)
		:precondition
		(and
			(or
				(sasiad ?p ?pp)
				(sasiad ?pp ?p)
			)
			(robot-gdzie ?p)
		)
		:effect
		(and
			(not (robot-gdzie ?p))
			(robot-gdzie ?pp)
		)
	)
	
	(:action zaladuj
		:parameters (?o - obiekt ?p - pole)
		:precondition
		(and
			(robot-gdzie ?p)
			(obiekt-gdzie ?o ?p)
			(chwytak-pusty)
		)
		:effect
		(and
			(not (chwytak-pusty))
			(obiekt-trzymany ?o)
			(not (obiekt-gdzie ?o ?p))
		)
	)
	
	(:action rozladuj
		:parameters (?o - obiekt ?p - pole)
		:precondition
		(and
			(obiekt-trzymany ?o)
			(robot-gdzie ?p)
		)
		:effect
		(and
			(chwytak-pusty)
			(not (obiekt-trzymany ?o))
			(obiekt-gdzie ?o ?p)
		)
	)
)

; problem
(define (problem p1)
(:domain cwiczenie)
(:objects A B C D E F G - pole
		paleta skrzynka - obiekt
)
(:init
	(robot-gdzie A)
	(obiekt-gdzie paleta E)
	(obiekt-gdzie skrzynka G)
	(chwytak-pusty)
	(sasiad A B)
	(sasiad E B)
	(sasiad C B)
	(sasiad C D)
	(sasiad D F)
	(sasiad F G)
)
	
(:goal 
	(and
		(obiekt-gdzie paleta C)
		(obiekt-gdzie skrzynka B)
	)
)
)

; plan
1. (jedz-z-do a b)
   deleted: (robot-gdzie a)
   added: (robot-gdzie b)
   goals met: 0 of 2
2. (jedz-z-do b e)
   deleted: (robot-gdzie b)
   added: (robot-gdzie e)
   goals met: 0 of 2
3. (zaladuj paleta e)
   deleted: (chwytak-pusty) (obiekt-gdzie paleta e)
   added: (obiekt-trzymany paleta)
   goals met: 0 of 2
4. (jedz-z-do e b)
   deleted: (robot-gdzie e)
   added: (robot-gdzie b)
   goals met: 0 of 2
5. (jedz-z-do b c)
   deleted: (robot-gdzie b)
   added: (robot-gdzie c)
   goals met: 0 of 2
6. (rozladuj paleta c)
   deleted: (obiekt-trzymany paleta)
   added: (chwytak-pusty) (obiekt-gdzie paleta c)
   goals met: 1 of 2
7. (jedz-z-do c d)
   deleted: (robot-gdzie c)
   added: (robot-gdzie d)
   goals met: 1 of 2
8. (jedz-z-do d f)
   deleted: (robot-gdzie d)
   added: (robot-gdzie f)
   goals met: 1 of 2
9. (jedz-z-do f g)
   deleted: (robot-gdzie f)
   added: (robot-gdzie g)
   goals met: 1 of 2
10. (zaladuj skrzynka g)
   deleted: (chwytak-pusty) (obiekt-gdzie skrzynka g)
   added: (obiekt-trzymany skrzynka)
   goals met: 1 of 2
11. (jedz-z-do g f)
   deleted: (robot-gdzie g)
   added: (robot-gdzie f)
   goals met: 1 of 2
12. (jedz-z-do f d)
   deleted: (robot-gdzie f)
   added: (robot-gdzie d)
   goals met: 1 of 2
13. (jedz-z-do d c)
   deleted: (robot-gdzie d)
   added: (robot-gdzie c)
   goals met: 1 of 2
14. (jedz-z-do c b)
   deleted: (robot-gdzie c)
   added: (robot-gdzie b)
   goals met: 1 of 2
15. (rozladuj skrzynka b)
   deleted: (obiekt-trzymany skrzynka)
   added: (chwytak-pusty) (obiekt-gdzie skrzynka b)
   goals met: 2 of 2
